AddTooltipEvent('ja_jp', {

  'minecraft:diamond': {
    mode: 'add',
    normal: [
      'なんてきれいなんだ'
    ]
  },
  'gtceu:gravity_well':{mode:'only',normal:
    ['特異的な質量と偏向されて重力で因果を捻じ曲げ特異点を生成する機械',
      'この技術をどのように開発したのか、なぜか情報が見当たらない','まさに技術の§a§n特異点§rといえるだろう','===============',
        '特異的な技術により、§6完璧なOC§r及び複数ハッチによる§6昇圧§rを可能とする']},
 'kubejs:gravity_tune_casing':{mode:'only',normal:
    ['元となった原子制御技術から超越的な発展を遂げたブロック','それはパラダイムシフトと評され、','現代科学では不可能とされた事象を成し遂げた証である']},
    'kubejs:gravity_defrection_block':{mode:'only',normal:
        ['パラダイムシフトにより発明された特異的なブロック','重力を望む形に§4捻じ曲げる','人類は、ここまで来た']},
'kubejs:local_trasfer_core_block':{mode:'only',normal:['位相転写技術により、座標をもとに空間事転写させる技術の根幹',
  '非常に緻密な構造であり、とても量産に向いた仕組みではない','特定の次元を転写するさい、このブロックが灯台となり基準点となる',
  '周囲に複数の転移コアがあると混線し、かつ影響範囲を広げようとすると','物質の反発がおおきくなりすぎて実体化しないため、この範囲が限界である',
  'かつてこの技術にたどりついた古代文明は、灯台を忘れ次元は捻じれ砕けた',
  'その過去の遺骸は遠く遠く地の果てに放棄され、後世の人類はそれを','ファーランドと呼んだ','shiftで性能を表示'
],shift: [
      '転写可能な範囲:',
      '（X,Y,Z）＝（8,20,8）'
    

]},
 'kubejs:dimensional_tearresistant_casing':{mode:'only',normal:['次元転写に際して、その空間の一意性を確保するためのケーシング','物質として複雑かつ、ある程度の強度がありかつ位相的な強度が非常に高い',
  '次元転写はいわばはりつけ、単純な物質の集合では太刀打ちできない'],shift: [
      '内部には強い重みかつ、複雑な物質である',
      '一酸化二水素で満たされている。そのため物理的、位相的どちらでも強い'
    ]},
 'kubejs:advanced_trasfer_core_block':{mode:'only',normal:[
  'すでに歴史に眠っていた位相転写技術は、特異点という','超常的技術により再び活躍することとなった。',
  'かつての挫折であった物質による反発は特異点により消えた','追い越された化学はその足元に届き、そして通り過ぎた',
  '圧倒的なエネルギー効率及び影響範囲を獲得し',
  'これまでとは比べ物にならないほどおおきなブロックを出力する'
],shift:[ '転写可能な範囲:',
      '（X,Y,Z）＝（16,30,16）'
    ]},

 'gtceu:local_transfer':{mode:'only',normal:[
  '特異点による空間制御技術によってつくられたオーバーテクノロジー',
  'この特異点技術は、偶発的に発見されたものであり、現代科学では原理が不明'
  ,'なぜ可能なのかすらわからないが、確固たる再現性が、','現代科学の延長にあることを示している'
,'ミスをすると空間破談による悲惨な結末を迎えるが','どうにか最先端科学でそれを防ぐことには成功している'
,'現代科学のあずかり知れないところで、たしかに未知の物理が働いている'
,'膨大な実験の末、与えられた座標をそのまま転移させる技術が完成した'
,'単に剽窃を行うだけでは空間に反発されるので、ある程度の気体を送り返さなければならない'
,'===============',
'§1特異点§rの技術は精密な機械稼働に影響を及ぼす',
'通常のオーバークロックはできず§d不完全なOC§rのみが可能である'
,'また、構造に用いた転移コアの性能によって出力されるブロックの総数が変化する'
]},

'gtceu:raw_originalim':{mode:'only',normal:['完璧な真我'],shift:['オリジニウム？知らない子ですね']},
'gtceu:frostproof_machine_casing':{mode:'only',normal:['バッチェ冷えてますよ']},
 'minecraft:deepslate':{mode:'add',normal:['(§7ディープステート§rじゃないです)']},
'gtceu:large_protoassembly':{mode:'only',normal:['高度な試作品を製作するためのアセンブリ','計算による結果シミュレーションおよび堅牢なつくりにより、','間違えて爆発することはあまりない'
,'電圧によって、成功確率がかなり上がるため、それを用いることが得策だろう','===============',
'革新的な技術により、§6完璧なOC§r及び複数ハッチによる§6昇圧§r','さらには§bパラレルハッチ§rによる並列稼働を可能とする'
]},






/*
 '':{mode:'only',normal:['','']},
*/
  'gtceu:gravity_tune_neutronium_event_horizon':{mode:'only',normal:
    [
        '膨大な質量を内包し、かつそれを制御する重力調律技術によって、',
        '内部に事象の地平線を生成する非常に発展的かつ、既存の物理学を超越する機械',
        'この機械の中でのみ、純粋な特異点を生成でき、さらには観測することも可能',
        '===============',
        '特異的な技術により、§6完璧なOC§r及び複数ハッチによる§6昇圧§rを可能とする'

    ]},
        'gtceu:atomic_casing': {
    mode: 'only',
    normal: [
      '原子制御技術によって形作られた至高のブロック',
      'どんな事象にも耐えうる堅牢さを持つ'
    ],
    shift: [
      'なぜかは分からないが、内部に1㎥以上の空間がある。',
      'すでに技術が人知超えた可能性がある'
    ]
  }
})
AddTooltipEvent('ja_jp', [
  {
    items: ['gtceu:timeline_plate', 'gtceu:timeline_ingot'],
    mode: 'add',
    normal: [
      '無限に偏在する§kXX§r時流§kXX§rを、§6超越次元文明§rにより',
      '一つの物質として固定し収束させたもの',
      'この収束によって、非加算無限個の§4因果§rと§a時間軸§rを束ねる',
      'これにより、物理学を超越し、無限速度の状態共有を可能とする',
      '現代文明では物理学においてそもそも定義されていない',
      'まさしく§n三次元文明§rの終着点であり、この物語の終わりである'
    ]
  }
])